# pandas에서 제공하는 대표적인 자료구조

+ Series
    - 값 + index
    
+ DataFrame
    - 여러개의 Series를 묶어놓은 형태

+ https://pandas.pydata.org

# 1. Series

In [1]:
import pandas as pd
import numpy as np

In [46]:
s = pd.Series([9904312, 3448737, 2890451, 246652])
print(s)
print(type(s))

0    9904312
1    3448737
2    2890451
3     246652
dtype: int64
<class 'pandas.core.series.Series'>

In [49]:
for i in enumerate([9904312, 3448737, 2890451, 246652]):
    print(i)

(0, 9904312)
(1, 3448737)
(2, 2890451)
(3, 246652)

In [51]:
### 인덱스를 자유롭게 사용
s = pd.Series([9904312, 3448737, 2890451, 246652],index=['서울','부산','인천','대구'])
print(s)

print('---------------------------------------------------')

print(s.values, type(s.values))
print(s.index)

print('---------------------------------------------------')

# 인덱스에 이름 지정
s.index.name = '도시'
print(s)

print('---------------------------------------------------')

# Series 전체에 이름 지정
s.name = "인구"
print(s)

서울    9904312
부산    3448737
인천    2890451
대구     246652
dtype: int64
---------------------------------------------------
[9904312 3448737 2890451  246652] <class 'numpy.ndarray'>
Index(['서울', '부산', '인천', '대구'], dtype='object')
---------------------------------------------------
도시
서울    9904312
부산    3448737
인천    2890451
대구     246652
dtype: int64
---------------------------------------------------
도시
서울    9904312
부산    3448737
인천    2890451
대구     246652
Name: 인구, dtype: int64

In [52]:
### 벡터화 연산

s1 = s / 1000000
s1

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    0.246652
Name: 인구, dtype: float64

In [53]:
### 인덱싱
print(s[1], s["서울"])

print('---------------------------------------------------')

print(s[[0,3,1]], s[['서울','대구','부산']])

print('---------------------------------------------------')

print(s[(s>250e4) & (s<500e4)])

print('---------------------------------------------------')

print(s[1:3])
print(s["부산":"대구"])

print('---------------------------------------------------')

print(s.부산, ",",s.서울)

3448737 9904312
---------------------------------------------------
도시
서울    9904312
대구     246652
부산    3448737
Name: 인구, dtype: int64 도시
서울    9904312
대구     246652
부산    3448737
Name: 인구, dtype: int64
---------------------------------------------------
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
---------------------------------------------------
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
도시
부산    3448737
인천    2890451
대구     246652
Name: 인구, dtype: int64
---------------------------------------------------
3448737 , 9904312

In [54]:
### Series와 dict

print("서울" in s)
print("대전" in s)

print('---------------------------')

print(list(s.items()))
for k,v in s.items():
    print("%s = %d"%(k,v))
    
print('---------------------------')

s2 = pd.Series({"서울":9631482, "부산":3448737, "인천":2632035, "대전":1490158})
print(s2)

True
False
---------------------------
[('서울', 9904312), ('부산', 3448737), ('인천', 2890451), ('대구', 246652)]
서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 246652
---------------------------
서울    9631482
부산    3448737
인천    2632035
대전    1490158
dtype: int64

In [58]:
### 인덱스 기반 연산

print(s)
print("------------------")
print(s2)
print("------------------")

result = s-s2
print(result)

print("------------------")

print(s.values - s2.values)

도시
서울    9904312
부산    3448737
인천    2890451
대구     246652
Name: 인구, dtype: int64
------------------
서울    9631482
부산    3448737
인천    2632035
대전    1490158
dtype: int64
------------------
대구         NaN
대전         NaN
부산         0.0
서울    272830.0
인천    258416.0
dtype: float64
------------------
[  272830        0   258416 -1243506]

In [66]:
### 결측치 제거
print(result)
print(result.notnull())
print(result[result.notnull()])

print("------------------")

# s와 s2 데이터를 이용해서 인구 증가율 : (끝 연도 - 시작 연도) / 시작 연도 * 100
result2 = (s2-s)/s*100
print(result2)
print("------------------")
result2 = result2[result2.notnull()]
print(result2)

대구         NaN
대전         NaN
부산         0.0
서울    272830.0
인천    258416.0
dtype: float64
대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool
부산         0.0
서울    272830.0
인천    258416.0
dtype: float64
------------------
대구         NaN
대전         NaN
부산    0.000000
서울   -2.754659
인천   -8.940335
dtype: float64
------------------
부산    0.000000
서울   -2.754659
인천   -8.940335
dtype: float64

In [68]:
### 데이터를 수정, 삭제, 갱신

# 수정
result2['부산'] = 1.63
print(result2)
print('-------------------')

# 갱신
result2['대구'] = 1.41
print(result2)
print('-------------------')

#삭제
del result2['서울'] 
print(result2)

부산    1.630000
서울   -2.754659
인천   -8.940335
dtype: float64
-------------------
부산    1.630000
서울   -2.754659
인천   -8.940335
대구    1.410000
dtype: float64
-------------------
부산    1.630000
인천   -8.940335
대구    1.410000
dtype: float64

# 2. DataFrame

In [151]:
data = {
    "2015":[9904312, 3448737, 2890451, 2466052],
    "2010":[9631482, 3393191, 2632035, 2431774],
    "2005":[9762546, 3512547, 2517680, 2456016],
    "2000":[9853972, 3655437, 2466338, 2473990],
    "지역":["수도권","경상권","수도권","경상권"],
    "2010-2015 증가율":[0.0283, 0.0163, 0.0982, 0.0141]
    }
print(type(data))
print(data)

<class 'dict'>
{'2015': [9904312, 3448737, 2890451, 2466052], '2010': [9631482, 3393191, 2632035, 2431774], '2005': [9762546, 3512547, 2517680, 2456016], '2000': [9853972, 3655437, 2466338, 2473990], '지역': ['수도권', '경상권', '수도권', '경상권'], '2010-2015 증가율': [0.0283, 0.0163, 0.0982, 0.0141]}

In [152]:
df = pd.DataFrame(data)
df

      2015     2010     2005     2000   지역  2010-2015 증가율
0  9904312  9631482  9762546  9853972  수도권         0.0283
1  3448737  3393191  3512547  3655437  경상권         0.0163
2  2890451  2632035  2517680  2466338  수도권         0.0982
3  2466052  2431774  2456016  2473990  경상권         0.0141

### 1). 컬럼의 위치(순서) 변경

In [153]:
cols = ["지역","2015","2010","2005","2000","2010-2015 증가율"]
df = pd.DataFrame(data,columns=cols)
df

    지역     2015     2010     2005     2000  2010-2015 증가율
0  수도권  9904312  9631482  9762546  9853972         0.0283
1  경상권  3448737  3393191  3512547  3655437         0.0163
2  수도권  2890451  2632035  2517680  2466338         0.0982
3  경상권  2466052  2431774  2456016  2473990         0.0141

### 2) 인덱스 변경

In [154]:
idx = ['서울','부산','인천','대구']
df = pd.DataFrame(data, columns=cols, index = idx)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [155]:
print(df.values)
print('-------------------------------------------------------')
print(df.columns)
print('-------------------------------------------------------')
print(df.index)

[['수도권' 9904312 9631482 9762546 9853972 0.0283]
 ['경상권' 3448737 3393191 3512547 3655437 0.0163]
 ['수도권' 2890451 2632035 2517680 2466338 0.0982]
 ['경상권' 2466052 2431774 2456016 2473990 0.0141]]
-------------------------------------------------------
Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')
-------------------------------------------------------
Index(['서울', '부산', '인천', '대구'], dtype='object')

In [156]:
### 컬럼과 인덱스에 이름 부여

df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [157]:
### 전치 가능
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

### 3) 인덱싱

In [158]:
print(df)
print('-------------------------------------------------------------------------')
# 하나의 열은 하나의 Series
print(df['지역'])
print(type(df['지역']))
print('-------------------------------------------------------------------------')
print(df[['지역']])
print(type(df[['지역']]))
print('-------------------------------------------------------------------------')
print(df[['2015','2010']])

# df[0] : 숫자로 지정 안됨
# df["2010" : "2000"] : 슬라이싱 안됨

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141
-------------------------------------------------------------------------
도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object
<class 'pandas.core.series.Series'>
-------------------------------------------------------------------------
특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권
<class 'pandas.core.frame.DataFrame'>
-------------------------------------------------------------------------
특성     2015     2010
도시
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [159]:
### 행 인덱싱(2개 이상 데이터를 뽑아올 때 반드시 : 으로 슬라이싱)
print(df[:])
print('--------------------------------------------------------------------')
print(df[:1])
print('--------------------------------------------------------------------')
print(df[1:3])
print('--------------------------------------------------------------------')
print(df['서울':'부산'])

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141
--------------------------------------------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
--------------------------------------------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
--------------------------------------------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163

In [160]:
### 동시에 행과 열 접근

print(df['2005']['서울'])
# df['2005','서울'] 이건 안됨
print('------------------------------------------')

# 2005년도와 2010년도의 서울 인구를 조회
df[['2005','2010']][:1]

9762546
------------------------------------------

특성     2005     2010
도시
서울  9762546  9631482

### 4) 열 데이터 갱신, 추가, 삭제

In [161]:
# 갱신
df["2010-2015 증가율"] = df['2010-2015 증가율'] * 100
df

# 추가
df["2015-2010 증가율"] = ((df['2010']-df['2005']) /df ['2005'] * 100).round(2)
df

# 삭제
del df['2010-2015 증가율']
df

특성   지역     2015     2010     2005     2000  2015-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

## 실습 1

In [3]:
data = {
    "국어":[80,90,70,30],
    "영어":[90,70,60,40],
    "수학":[90,60,80,70],
}

In [4]:
### 1. 인덱스를 춘향, 몽룡, 향단, 방자로 구성된 데이터 프레임 df를 생성
name = ['춘향','몽룡','향단','방자']
df = pd.DataFrame(data, index = name)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [5]:
### 2. 모든 학생의 수학 점수를 조회
print(df['수학'])

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [6]:
### 3. 모든 학생의 국어와 영어 점수를 조회
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [7]:
### 4. 모든 학생의 각 과목평균 점수를 새로운 열(과목평균)로 추가
#df['과목평균'] = ((df['국어'] + df['영어'] + df['수학']) / 3).round(2)
df['과목평균'] = (df[:].mean(axis=1)).round(2)
df

    국어  영어  수학   과목평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [30]:
### 5. 방자의 영어점수를 80점으로 수정하고, 평균 점수도 다시 수정
df['영어']['방자'] = 80
df['과목평균'] = ((df['국어'] + df['영어'] + df['수학']) / 3).round(2)
df['과목평균2']['방자'] = (df[['국어','영어','수학']]["방자":"방자"].mean(axis=1)).round(2)
df

<ipython-input-30-5fcbf4407ad6>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자'] = 80

    국어  영어  수학   과목평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [54]:
### 6. 춘향의 점수를 데이터 프레임 형식으로 출력
df[:1]

    A   B   C   D
a  10  11  12  13

In [43]:
### 7. 향단의 점수를 Series로 출력
df.T['향단']

국어      70.0
영어      60.0
수학      80.0
과목평균    70.0
Name: 향단, dtype: float64

In [8]:
[i for i in df["향단":"향단"].values]

[array([70., 60., 80., 70.])]

### 5) 파일 입출력
+ read_csv()
+ to_csv()
+ read_table()

In [12]:
%%writefile data/sample1.csv
# 매직 명령어 : 반드시 첫줄에 사용

c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing data/sample1.csv

In [18]:
sample1 = pd.read_csv('data/sample1.csv')
sample1

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [20]:
%%writefile data/sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting data/sample2.csv

In [22]:
# 컬럼이 없는경우 names 옵션 설정
sample2 = pd.read_csv('data/sample2.csv',names=["c1","C2","c3"])
sample2

   c1    C2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [24]:
# 특정한 열을 인덱스로 지정
sample3 = pd.read_csv('data/sample1.csv',index_col="c1")
sample3

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [25]:
%%writefile data/sample3.txt
c1       c2       c3       c4
0.23     0.33     0.354    0.2389
0.123    0.345    0.567    0.986

Writing data/sample3.txt

In [33]:
# 공백의 길이가 다 다를경우 정규표현식 사용
pd.read_table("data/sample3.txt",sep="\s+")

      c1     c2     c3      c4
0  0.230  0.330  0.354  0.2389
1  0.123  0.345  0.567  0.9860

In [34]:
%%writefile data/sample4.txt
파일제목 : sample4.txt
데이터 포맷의 설명 : 어쩌구 저쩌구
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing data/sample4.txt

In [36]:
# skiprows : 0,1번 행만 빼고 읽음
sample4 = pd.read_table("data/sample4.txt",skiprows=[0,1])
sample4

       c1, c2, c3
0    1, 1.11, one
1    2, 2.22, two
2  3, 3.33, three

In [37]:
%%writefile data/sample5.csv
c1,c2,c3
1,1.11,
2,,two
누락,3.33,three

Writing data/sample5.csv

In [41]:
# 결측치 NaN으로 통일 
sample5 = pd.read_csv('data/sample5.csv',na_values=[" ","누락"])
sample5

    c1    c2     c3
0  1.0  1.11    NaN
1  2.0   NaN    two
2  NaN  3.33  three

In [45]:
# csv로 저장

df.to_csv("data/sample6.csv")
df.to_csv("data/sample7.txt",sep="|")
df.to_csv("data/sample8.csv",index=False, header=False)

# 결측치의 표현 변경
sample5.to_csv("data/sample9.txt",sep=":", na_rep="누락")

### 6) Indexer
+ loc : 라벨값 기반의 2차원 인덱싱을 지원하는 인덱서
+ iloc : 순서를 나타내는 정수 기반의 인덱서
+ ix : loc와 마찬가지로 라벨값 기반의 인덱서, 하지만 속도는 빠르다
+ at
+ iat

### -loc : 열을 지정하고 행을 지정
### -index : 행을 지정하고 열을 지정

In [47]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4), index=["a","b","c"],columns = ["A","B","C","D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [59]:
### 첫번째 행 추출

print(df[:1])
print(df[:"a"])

print('---------------------------------')
print(df.loc['a'])

print('---------------------------------')
# 필터링 
print(df.loc[df["A"] > 15])

print('---------------------------------')

def select_row(df, num):
    return df.A > num 
print(df.loc[select_row(df,15)])

    A   B   C   D
a  10  11  12  13
    A   B   C   D
a  10  11  12  13
---------------------------------
A    10
B    11
C    12
D    13
Name: a, dtype: int64
---------------------------------
    A   B   C   D
c  18  19  20  21
---------------------------------
    A   B   C   D
c  18  19  20  21

In [91]:
### 행과 열을 모두 사용할 경우

# a행 A열에 있는 하나의 값을 추출
print(df['A']['a'])
print(df['B']['b'])

print('--------------------------')

# loc 사용
print(df.loc["a"]["A"])
print(df.loc["b"]["B"])

print('--------------------------')
print(df.loc["b":,"B":])

print('--------------------------')
print(df.loc[["a","c"],["B","C"]])

# 모든 행에 대해서 첫번째 행에 있는 값이 11보다 작거나 같은 행의 컬럼을 조회
print('--------------------------')
print(df.loc[:,df.loc['a',:]<=11])

10
15
--------------------------
10
15
--------------------------
    B   C   D
b  15  16  17
c  19  20  21
--------------------------
    B   C
a  11  12
c  19  20
--------------------------
    A   B
a  10  11
b  14  15
c  18  19

In [93]:
# 반드시 레이블로만 접근해야 된다.

# print(df.loc[1:, 1:])
# print(df.loc[[0,2],[1,2]])

### -iloc

In [126]:
print(df["A"])
print('-------------')
# 행은 숫자로 접근 가능하나 열은 불가능하다
# df[0]
# df.loc[0,0]

print(df.loc['a',"A"])

print('-------------')
print(df.iloc[0,0])
print(df.iloc[:2,2])
print(df.iloc[0,-1:])

'''
    B   C
c   19  20
'''
print('-------------')
print(df.iloc[[2],[1,2]])
print('-------------')
print(pd.DataFrame(df.iloc[2, 1:3]).T)

a    10
b    14
c    18
Name: A, dtype: int64
-------------
10
-------------
10
a    12
b    16
Name: C, dtype: int64
D    13
Name: a, dtype: int64
-------------
    B   C
c  19  20
-------------
    B   C
c  19  20

### -at

In [127]:
%timeit df.loc["a","A"]
%timeit df.at["a","A"]

4.61 µs ± 334 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)
2.9 µs ± 73.3 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

# 3. Data Manipulation

### 1) 데이터의 갯수 세기

In [139]:
### Series에서 갯수 세기
s = pd.Series(range(10))
s
s.count()

# 결측치를 빼고 count
s[3] = np.nan
s
s.count()

9

In [155]:
### DataFrame에서 갯수 세기
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype = float)
df
df.count()

# 결측치 확인
df.iloc[2,3] = np.nan
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [163]:
### titanic

import seaborn as sns
titanic = sns.load_dataset('titanic')
print(titanic.shape)
titanic.head()
titanic.count()

(891, 15)

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### 2) 카테고리별 갯수 세기

In [170]:
np.random.seed(1)

s2 = pd.Series(np.random.randint(6, size=100))
s2
df[0].value_counts()

3.0    2
4.0    1
0.0    1
Name: 0, dtype: int64